backend/data/simulations/maisnon/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 3e-6;

boundaryField
{
inlet
{
    type            fixedValue;
    value           uniform 3e-6;
}

outlet
{
    type            zeroGradient;
}

wall
{
    type            symmetry;
}

symmetry
{
    type            symmetry;
}

tube
{
    type            nutUSpaldingWallFunction;
    value           uniform 3e-6;
}

}


// ************************************************************************* //
